var char0 = {
    title1: "暴龍汪",
    text1: "不小心踹壞奇怪的機械，導致從古代穿越時空來到現代的狗狗。可是本身還不知道自己穿越時空來到現代。",
    title2: "小夥伴化石",
    text2: "雖然知道暴龍汪的秘密，但心懷敵意的化石沒有坦白告訴他。",
};
var char1 = {
    title1: "騎士汪",
    text1: "想救出公主並成為史上最酷的騎士狗狗。 有時候太天真。",
    title2: "小夥伴小盾牌​",
    text2: "每當戲弄純真的騎士汪時，總是感到快樂的小盾牌。​",
};
var char2 = {
    title1: "虎爛汪",
    text1: "我比任何人還要來得強！我就是山獸之君！ 自尊心很強，一不小心刺激他就會被咬。",
    title2: "小夥伴肉肉​",
    text2: "與虎爛汪有著又愛又恨的關係，常常想要避開他，但一旦沒看到他，又會擔心他。 ​",
};
var char3 = {
    title1: "炸彈汪",
    text1: "發現掉落在路邊的紙條與帽子後，天真地戴上危險帽子的狗狗。 帽子很敏感，只要有些微的衝擊感，就會爆炸。​",
    title2: "小夥伴番仔火​",
    text2: "想要與認為會點燃帽子的炸彈汪解除誤會的番仔火。​",
};

var char4 = {
    title1: "小花汪",
    text1: "喜歡花朵且很親切的狗狗。超喜歡花朵，所以自己擁有專用的花圃。如果弄壞花圃的話…",
    title2: "小夥伴鬱金香",
    text2: "管理小花汪的花圃並跟她一起生活的鬱金香。",
};
var char5 = {
    title1: "咕雞汪",
    text1: "為了炸雞店吉祥物面試，穿成雞衣服的狗狗。聽說他是雄性，所以沒有通過面試。很會碎碎念但又會照顧別人的性格。",
    title2: "小夥伴雞腿君",
    text2: "炸雞店的吉祥物雞腿，一直無法理解咕雞汪的執著。 ​",
};

// 小狗按鈕
var char_info = "";
for ($i = 0; $i <= 5; $i++) {
    char_info +=
        `<div class="btn" onclick="tab_btn(` +
        $i +
        `)">
        <img src="/img/front/sec4_btn` +
        $i +
        `.png">
    </div>`;
}
$(".sec4_box4").html(char_info);
